admin_test/z_artilleryTest/tuning_target_api.yml
config:
#  target: "http://localhost:8200"
  target: "https://admin-api.pass-dev-aptner.com"
  http:
    headers:
      Connection: close
    timeout: 120000     # 전체 요청 타임아웃(ms)
    response_timeout: 10000  # ms 단위 (예: 10초)
  phases:
    - name: "READ 튜닝 대상 API"
      duration: 60 # 초 동안 실행을 하겠다.
      arrivalRate: 100 # 초당 N명의 사용자가 API 호출
  #      rampTo: 20 # N 초에 걸쳐 얼마나 증가

  defaults:
    headers:
      User-Agent: "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.3"
      Accept: "application/json, text/plain, */*"
      Authorization: "Bearer eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ0ZXN0OSIsImlzcyI6InBhc3MtYXV0aCIsImlhdCI6MTc1MTAwNTI1NSwiZXhwIjoxNzUxMDQ4NDU1LCJhcHRuZXItcGFzcy1hdXRoLW1ldGhvZCI6IlNUQUZGX0lEIiwiYXB0bmVyLXBhc3MtZG9tYWluIjoiQURNSU4iLCJjbGllbnQtaXAiOiIxMjcuMC4wLjEiLCJqdGkiOiIxNSJ9.1uc1EYB-qm73JWm3zZO68toDvLEaAvkdggK74lHVukk"
#      Authorization: "Bearer eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ0ZXN0MTAiLCJpc3MiOiJwYXNzLWF1dGgiLCJpYXQiOjE3NTEwMDI1MjYsImV4cCI6MTc1MTAwNjEyNiwiYXB0bmVyLXBhc3MtYXV0aC1tZXRob2QiOiJTVEFGRl9JRCIsImFwdG5lci1wYXNzLWRvbWFpbiI6IkFETUlOIiwiY2xpZW50LWlwIjoiMDowOjA6MDowOjA6MDoxIiwianRpIjoiMTYifQ.79ke7EDoBoPuZUCg7Ib9kNaDiHKIzpp_zY_XwmGA4XI"
      Content-Type: "application/json"
      aptner-pass-apt-id: "1100000001"

scenarios:
  - name: READ 튜닝 대상 API
    flow:
      - post:
          url: "/member/use/ticket/program-ticket/search" # 회원 구매가능한 정기/기간 이용권 검색
          json:
            searchYearMonth: "2025-06"
            memberId: 1100000070
            pagination:
              page: 1
              size: 20
              isTotalNeeded: true
#      - post:
#          url: "/member/use/ticket/own/list/get" # 이용권 보유 조회
#          json:
#            memberId: 1100000070
#            pagination:
#              page: 1
#              size: 20
#              isTotalNeeded: true
#      - post:
#          url: "/sales/canceled/search" # 매출취소내역 조회
#          json:
#            facilityTypeId: null
#            platform: "ALL"
#            cancelReasonType: null
#            paymentMethod: "ALL"
#            salesSearchMethod: "SALES_DATE"
#            from: "2025-01-01"
#            to: "2025-12-31"
#            pagination:
#              page: 1
#              size: 50
#              isTotalNeeded: true
#      - post:
#          url: "/operation-time-override/surcharge-date/search" # 할증일 목록 조회
#          json:
#            from: "2025-06-01"
#            to: "2025-07-05"
#      - post:
#          url: "/facility/info/search" # 시설 목록 검색
#          json:
#            pagination:
#              page: 1
#              size: 50
#              isTotalNeeded: true
#      - post:
#          url: "/member/ticket/program/search" # 정기권 기간권 회원내역 목록 조회
#          json:
#            yearMonth: "2025-06"
#            pagination:
#              page: 1
#              size: 20
#              isTotalNeeded: true
#      - post:
#          url: "/facility/batter-box/search" # 타석 목록 조회
#          json:
#            facilityId: 17
#            pagination:
#              page: 1
#              size: 50
#              isTotalNeeded: true
#      - post:
#          url: "/gate-access/member-owned/ticket/search" # 회원 출입가능 이용권 목록 조회
#          json:
#            enterDate: "2025-06-25"
#            memberId: 1100000070
#      - post:
#          url: "/gate/search" # 출입계정 게이트 검색
#          json:
#            pagination:
#              page: 1
#              size: 20
#              isTotalNeeded: true
#      - post:
#          url: "/facility/seat/search" # 좌석 정보 목록 조회
#          json:
#            facilityId: 4
#            pagination:
#              page: 1
#              size: 20
#              isTotalNeeded: true
#      - post:
#          url: "/reservation/batter-box/time-table/current/all/get" # 모든 타석 타임테이블 현황 조회
#          json:
#            facilityId: 83
#            useDate: "2025-06-26"
#      - post:
#          url: "/reservation/batter-box/first-come/current/all/get" # 모든 타석 선착순 현황 조회
#          json:
#            facilityId: 2
#            useDate: "2025-06-26"
#      - post:
#          url: "/reservation/private-room/timetable/detail" # 시설의 날짜에 따른 예약 상세내역 조회
#          json:
#            facilityId: 16
#            date: "2025-06-26"
#      - post:
#          url: "/reservation/private-room/timetable/get" # 스크린골프 예약 현황 조회
#          json:
#            facilityTypeId: 4
#            from: "2025-06-01"
#            to: "2025-07-05"
#      - post:
#          url: "/reservation/guest-room/search" # 게스트룸 예약 현황 조회
#          json:
#            facilityTypeId: 5
#            from: "2025-06-01"
#            to: "2025-07-05"
#      - post:
#          url: "/reservation/locker/search" # 사물함 예약 현황 조회
#          json:
#            facilityId: 57